``` Terraform will perform the following actions:

  # aws_route53_record.grafana-usegalaxy will be updated in-place
  ~ resource "aws_route53_record" "grafana-usegalaxy" {
        id              = "Z386N8B8JBC6TQ_stats.galaxyproject.eu_A"
        name            = "stats.galaxyproject.eu"
      ~ records         = [
          - "132.230.224.70",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.usegalaxy_eu_dmarc_txt will be updated in-place
  ~ resource "aws_route53_record" "usegalaxy_eu_dmarc_txt" {
        id              = "Z1C7L7XFF9613J__dmarc.usegalaxy.eu_TXT"
        name            = "_dmarc.usegalaxy.eu"
      ~ records         = [
          - "v=DMARC1; p=reject; pct=100; rua=mailto:dmarc-66c44965559d8b25a9140b95@forwardemail.net;",
          + "v=DMARC1;p=reject;pct=100;ruf=mailto:galaxy-ops@informatik.uni-freiburg.de;aspf=r",
        ]
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.usegalaxy_eu_spf_txt will be updated in-place
  ~ resource "aws_route53_record" "usegalaxy_eu_spf_txt" {
        id              = "Z1C7L7XFF9613J__TXT"
      ~ records         = [
          - "forward-email-site-verification=XS8hOkR5lO",
          + "v=spf1 include:mailgun.org -all",
        ]
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.grafana will be created
  + resource "openstack_compute_instance_v2" "grafana" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.large"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "vgcn~rockylinux-9-latest-x86_64~+generic+internal~20240820~42312~HEAD~479ec25"
      + key_pair            = "cloud2"
      + name                = "stats.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-web2",
        ]
      + stop_before_destroy = false

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public-extended"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.stats-data-vol1 will be created
  + resource "openstack_compute_volume_attach_v2" "stats-data-vol1" {
      + device      = "/dev/vdb"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = "ad56f01f-cb21-458c-b1f9-90f937aa6525"
    }

  # openstack_compute_volume_attach_v2.stats-data-vol2 will be created
  + resource "openstack_compute_volume_attach_v2" "stats-data-vol2" {
      + device      = "/dev/vdc"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = "254b499b-1293-4341-ba52-2901bbe56fcb"
    }

Plan: 3 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```